Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་རྒྱུད།
en: The Root Manual of the Rites of Mañjuśrī

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Oṁ , homage to all the buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་གནས་གཙང་མའི་སྟེང་གི་ནམ་མཁའི་དཀྱིལ་ན། བྱང་ཆུབ་སེམས་དཔའ་འདུས་པའི་འཁོར་གྱི་ཚོགས་སོ་སོ་ཐ་དད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ངོ་མཚར་རྨད་དུ་བྱུང་བ། སོ་སོར་རབ་ཏུ་གནས་པ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: Lord Śākyamuni dwelt above the Pure Abode, in an inconceivable, wondrous pavilion, circular in shape, with a congregation of bodhisattvas distributed all around, located in the canopy of the sky.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ལ་བཀའ་སྩལ་པ།
en: There the Lord addressed the gods of the Pure Abode: {1.1}

source: ལྷའི་བུ་དག་ཁྱེད་ཅག་ཉོན་ཅིག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ཆོ་འཕྲུལ་གྱི་སྤྱོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཏིང་ངེ་འཛིན་གྱི་བྱེ་བྲག་དང་། རྫུ་འཕྲུལ་དང་།
en: “Honored gods! Listen as I tell of the inconceivable, wondrous miracles of Mañjuśrī, the divine youth, bodhisattva, and great being—listen as I tell of his conduct, different types of samādhi, and magical power;

source: རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་དང་།
en: his liberation, maṇḍala, and his miraculous bodhisattva manifestations;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བ། ཚེ་དང་ནད་མེད་པ་དང་དབང་ཕྱུག་དང་།
en: and how he is the sustenance for all beings and brings them life, health, and sovereignty!

source: ཡིད་ལ་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་སྔགས་ཀྱི་གཞི་དག་སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར་བཤད་པར་བྱ་སྟེ
en: I will explain, for the benefit of all beings, the mantra subjects that completely fulfill one’s wishes.

source: དེ་ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་བཤད་པར་བྱའོ། །
en: Listen well and duly reflect upon it—I will now tell you about him.” {1.2}

source: དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་གིས་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: Thereupon the gods of the Pure Abode, folding their hands, said:

source: བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ཏིང་ངེ་འཛིན་གྱི་ཁྱད་པར་དང་། ས་ཆེན་པོ་ཐོབ་པར་བྱ་བ་དང་།
en: “Then tell us, Lord, about the conduct of the bodhisattvas; their different samādhis and their attainment of the bodhisattva levels;

source: རྡོ་རྗེའི་གདན་གནོན་པ་དང་། བདུད་གདུལ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་།
en: their sitting upon the vajra throne, overpowering of Māra , and turning of the wheel of Dharma;

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ངེས་པར་འབྱུང་བ་དང་།
en: their liberating of all śrāvakas and pratyeka­buddhas;

source: ལྷ་རྣམས་དང་མི་རྣམས་སུ་སྐྱེ་བར་བྱ་བ་དང་། སྡུག་བསྔལ་དང་། དབུལ་བ་དང་། ནད་ཐམས་ཅད་ཞི་བར་བྱེད་པ། ལོངས་སྤྱོད་ཀྱིས་ཕྱུག་པ་འདྲེན་པར་བྱེད་པ།
en: their ensuring for all beings rebirth as a god or a human and the pacification of all suffering; their removal of diseases of the poor, sick, and wealthy alike;

source: འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྔགས་ཀྱི་སྤྱོད་པས་ཕོངས་པར་མི་བྱེད་པ།
en: their invulnerability to the use of all mundane and supramundane mantras;

source: རེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསུང་འབྲས་བུ་མེད་པར་བྱེད་པ་མ་ཡིན་པ།
en: and their fulfilling of all wishes that thus makes the speech of all the tathāgatas fruitful.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱམས་པའི་ཐུགས་དང་། ཕན་པའི་ཐུགས་དང་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་ནས་བཅོམ་ལྡན་འདས་དེ་བཤད་དུ་གསོལ།
en: Lord, speak with a mind full of love and concern for our welfare, and out of pity for all sentient beings.” {1.3}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་རྣམས་དང་གནས་གཙང་མའི་གནས་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་གཟིགས་ནས། དག་པའི་ཡུལ་ལ་འོད་རྣམ་པར་སྤྲོས་ཏེ། ཡུལ་རྣམ་པར་འཇིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: Then Lord Śākyamuni, casting a glance with his buddha eye over the entire realm of the Pure Abode, entered the samādhi called the spreading and diffusing of the light of the pure sphere.

source: བཅོམ་ལྡན་འདས་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་མཛོད་སྤུ་ནས་མེ་ཏོག་ཀུན་ཏུ་སྐྱེས་པ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་བསྐུལ་བ་ཞེས་བྱ་བའི་འོད་ཕྱུང་སྟེ།
en: As soon as the Lord entered this samādhi, out of his ūrṇā came an array of light rays called arouser of the bodhisattva Saṃkusumita;

source: འོད་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱ་སྟོང་དུ་མའི་འཁོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས།
en: he was surrounded by many hundreds of thousands of millions of rays.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སོང་ནས།
en: The light circumambulated the Buddha three times and,

source: བྱང་ཤར་གྱི་ཕྱོགས་སུ་བརྒྱ་སྟོང་གི་གང་གཱའི་ཀླུང་གི་འཇིག་རྟེན་གྱི་ཁམས་འདས་ནས།
en: having passed through billions of trichiliocosms and crossed as many worlds in the northeastern direction as there are grains of sand in one hundred thousand Gaṅgā rivers,

source: མེ་ཏོག་དང་ལྡན་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་རྗེས་སུ་ཞུགས་ཏེ།
en: it came to the world sphere called Kusumāvatī,

source: གང་ན་མེ་ཏོག་ཀུན་དུ་སྐྱེས་པའི་རྒྱལ་པོའི་དབང་པོ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་བཞུགས་པར་རོ། །
en: where the tathāgata Saṃkusumita Rājendra was staying.

source: དེར་ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྔོན་གྱི་སྨོན་ལམ་གྱི་དབང་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྤྱོད་པ་དང་ལྡན་པ་རྣམས་དང་ལྷན་ཅིག་གནས་པར་གྱུར་ཏོ། །
en: Due to the power of his previous aspirations, Mañjuśrī was also staying there together with other bodhisattvas, great beings engaged in bodhisattva activity.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འོད་ཟེར་གྱི་སྣང་བ་དེ་མཐོང་ནས། བཞིན་ཅུང་ཟད་འཛུམ་པ་དང་ལྡན་པར་གྱུར་ནས་
en: Seeing this effulgence of light, he gently smiled and

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་དག་ལ་སྨྲས་པ།
en: addressed the multitude of bodhisattvas: {1.4}

source: རྒྱལ་བའི་སྲས་དག་འོད་འདི་ནི་ང་ལ་ཡང་དག་པར་བསྐུལ་བའི་ཕྱིར་འོངས་པ་ཡིན་གྱིས།
en: “This arousing ray of light, O sons of the victorious ones, has come here to wake me up.

source: ཁྱེད་ཅག་གཡེང་བ་མེད་པར་གྱིས་ཤིག་ཅེས་སྨྲས་སོ། །
en: Do pay attention!” {1.5}

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་མིག་མི་འཛུམས་ཤིང་ཁ་བྱེ་བས། འོད་གང་ན་བ་དེ་ལོགས་སུ་མངོན་དུ་བལྟས་ནས་འདུག་གོ། །
en: Then Mañjuśrī, the divine youth, the bodhisattva, the great being, with his eyes wide and unblinking, sat facing the radiance of the ray.

source: དེ་ནས་བསྐུལ་བའི་འོད་དེས་མེ་ཏོག་དང་ལྡན་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཆེན་པོས་སྣང་བར་བྱས་ཏེ།
en: And this arousing ray, illuminating the Kusumāvatī world sphere with great radiance,

source: མེ་ཏོག་ཀུན་དུ་སྐྱེས་པ་རྒྱལ་པོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: circumambulated the thus-gone lord Saṃkusumita Rājendra clockwise three times and

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་སྤྱི་བོར་ནུབ་པར་གྱུར་ཏོ། །
en: dissolved into the head of the great being, the bodhisattva Mañjuśrī. {1.6}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ།
en: The divine youth Mañjuśrī then got up from his seat and

source: བཅོམ་ལྡན་འདས་མེ་ཏོག་ཀུན་དུ་ཡང་དག་པར་སྐྱེས་པ་རྒྱལ་པོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: circumambulated the thus-gone lord Saṃkusumita Rājendra three times.

source: སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: Then, bowing his head and

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: placing his right knee on the ground,

source: བཅོམ་ལྡན་འདས་མེ་ཏོག་ཀུན་དུ་སྐྱེས་པ་རྒྱལ་པོའི་དབང་པོ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: he spoke to Lord Saṃkusumita Rājendra: {1.7}

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བདག་ལ་དགོངས་ཏེ།
en: “May Lord Śākyamuni, the tathāgata, the arhat, the completely awakened one, think of me.

source: བཅོམ་ལྡན་འདས་བདག་ནི་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་བལྟ་བ་དང་ཕྱག་བྱ་བ་དང་བསྙེན་བཀུར་བྱ་བ་དང་།
en: Let me go, O lord, from here to the Sahā world sphere to see Lord Śākyamuni, to honor him and serve him.

source: སྔགས་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དང་། སྒྲུབ་ཐབས་དང་། དཀྱིལ་འཁོར་དང་། ཆོ་ག་དང་། གསང་བ་དང་། ཆོ་ག་ཞིབ་མོ་དང་། ཆོ་གའི་ངོ་བོ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཐུགས་དང་། གསང་བ་དང་། ཕྱག་རྒྱ་དང་། དབང་བསྐུར་བ་བསྟན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ནས་མཆི་བར་འཚལ་ལོ། །
en: Let me go so that he may instruct me in the mantra practice, the sādhana practice, and the procedure of constructing the right maṇḍala; the secrets of the ritual and the procedure of drawing the picture; and the secret mudrā empowerment into the heart of all the tathāgatas, so that all the wishes of all beings are fulfilled.” {1.8}

source: དེ་སྐད་ཅེས་བཅོམ་ལྡན་འདས་མེ་ཏོག་ཀུན་དུ་སྐྱེས་པ་རྒྱལ་པོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་པ་དང་།
en: Being so addressed, the thus-gone lord Saṃkusumita Rājendra said this to Mañjuśrī, the divine youth:

source: དེ་ནས་བཅོམ་ལྡན་འདས་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པ་རྒྱལ་པོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Then, the thus-gone lord Saṃkusumita Rājendra further said this to Mañjuśrī, the divine youth:

source: གཞན་ཡང་གཞོན་ནུ་གང་གཱའི་ཀླུང་བརྒྱ་སྟོང་གི་བྱེ་མ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཁྱོད་ཀྱི་སྔགས་ཀྱི་སྤྱོད་པ་དང་། དཀྱིལ་འཁོར་དང་ཆོ་ག་ཞིབ་མོ་དང་གསང་བ་དང་། དབང་བསྐུར་བ་དང་ཕྱག་རྒྱའི་ཚོགས་དང་ཆོ་ག་དང་སྦྱིན་སྲེག་དང་། བཟླས་པ་དང་བརྟུལ་ཞུགས་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་སེམས་ཅན་ཐམས་ཅད་དགའ་བར་བྱེད་པ།
en: “Also, O divine youth, the tathāgatas, the arhats, the completely awakened ones, numerous as grains of sand in one hundred thousand Gaṅgā rivers, have taught and will teach again of your proficiency in mantra practice, maṇḍala ritual, the secret empowerment, the mudrās, the picture drawing procedure, the homa rite, the mantra recitation, and the regular observations, all of which fulfill every wish and bring joy to every being.

source: འོད་རིན་པོ་ཆེའི་ཚོགས་ཀྱིས་རབ་འབྱམ་འདས་པ་དང་ད་ལྟར་བྱུང་བ་དང་མ་འོངས་པའི་ཤེས་པ་རྒྱལ་པོའི་དབང་ཕྱུག་ལུང་སྟོན་པར་བྱེད་པ།
en: They will teach of your proficiency in the vast fields of astrology and gemology; of your knowledge of the past, present, and future; and of your ability to govern and make predictions.

source: སྔགས་བཟླ་བ་ཡུལ་གྱི་མཐར་འགྲོ་བར་བྱེད་པ་མི་སྣང་བར་བྱེད་པ་དང་། དུས་དང་དམ་ཚིག་རབ་འབྱམ་གྱི་ཚོགས་ཐམས་ཅད་དང་།
en: They will teach of your mantra repetition, your ability to travel to the ends of the earth and to become invisible, and your vast knowledge of the right time and occasion for anything.

source: འཇིག་རྟེན་པ་མ་ལུས་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་འཕགས་པ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ངེས་པར་འབྱུང་བའི་སྤྱོད་པ་མཐར་ཐུག་པ་གསུངས་པ་དང་། གསུང་བ་དང་། གསུང་བར་འགྱུར་བ་ཡིན་ཏེ
en: They will teach how to traverse all the stages of the buddhas, bodhisattvas, śrāvakas, and pratyeka­buddhas, and all the mundane and supramundane stages without exception. They will teach the way in which you are established in the practice of all of these.

source: དེ་ལྟར་རྗེས་སུ་ཡི་རང་བ་ཉིད་དེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་
en: So that I too may rejoice, please go Mañjuśrī, O divine youth, if you think that the time is right.

source: སོང་ཤིག །ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་མངོན་སུམ་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པར་འགྱུར་ཏེཁྱོད་ཀྱང་སྟོན་པར་འགྱུར་རོ། །
en: You will hear these teachings in the presence of Śākyamuni, face to face with him, and you will later give them yourself.

source: འདིར་ཡང་གསུངས་པ།
en: The mantra for this is as follows: {1.10}

source: ན་མཿསརྦ་ཏ་ཐཱ་ག་ཏཱ་ནཱཾ། ཨ་ཙིན་ཏྱ་ཨ་པྲ་ཏི་ཧ་ཏ་ཤཱ་ས་ནཱ་ནཱཾ། ཨོཾ་སྨ་ར་སྨ་ར་ཨ་པྲ་ཏི་ཧ་ཏ་ཤཱ་ས་ན་ཀུ་མཱ་ར་རཱུ་པ་ཧ་རི་ཎ། ཨོཾ་ཧཱུྃ་ཧཱུྃ་ཕཊ་ཕཊ་སྭཱ་ཧཱ།
en: “Homage to all the tathāgatas whose instructions are inconceivable and perfect! “ Oṁ, ra ra ! Do remember! O perfect teacher possessing the form of a divine youth! Hūṁ hūṁ! Phaṭ phaṭ! Svāhā! {1.11}

source: འདི་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྩ་བའི་སྔགས་སོ། །
en: “This was, O divine youth Mañjuśrī, the root mantra.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་སྟེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་ལ། གསུང་ཞིང་གསུང་བར་འགྱུར་ལ།
en: It is the heart essence of all the tathāgatas, and it was and will be recited by them.

source: ཁྱོད་ཀྱང་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སོང་ནས། དབྱེ་བ་དང་རྣམ་པར་དབྱེ་བ་རྒྱ་ཆེར་སྟོན་པར་འགྱུར་ཏེ།
en: You will also now recite this, the all-accomplishing mantra, together with all its parts, having arrived in the Sahā world.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བས་ཀྱང་ལས་ཐམས་ཅད་བྱེད་པ་འདི་རྗེས་སུ་གནང་བར་འགྱུར་རོ། །
en: This has been sanctioned by Śākyamuni.

source: འདིར་སྙིང་པོ་མཆོག་ཏུ་གྱུར་པ་ནི།
en: Here, the ultimate heart mantra is:

source: ཨོཾ་བཱ་ཀྱེ་དཾ་ན་མཿ། འདིར་ཉེ་བའི་སྙིང་པོ་ནི་བཱ་ཀྱེ་ཧཱུཾ།
en: “ Oṁ , this [mantra] is [my] homage to speech! {1.12} “The subsidiary heart mantra in this set is: “ Speech, hūṁ!” {1.13}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བཅོམ་ལྡན་འདས་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པ་རྒྱལ་པོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པས་གནང་ནས། བཀོད་པ་ཐམས་ཅད་ཀྱི་རྒྱན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་རྒྱུ་མཐུན་པ། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཐོབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: Lord Mañjuśrī, the divine youth, being thus granted leave by Saṃkusumita Rājendra, the tathāgata, entered the samādhi called the ornament of all supernal manifestations that brings the attainment of the essence of awakening which is a product of the conduct of a bodhisattva .

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཏིང་ངེ་འཛིན་གང་ལ་སྙོམས་པར་ཞུགས་པ་ན། ཕྱོགས་བཞི་མཐའ་ཡས་མུ་མེད་པ་སྟེང་དང་འོག་དང་ཐད་ཀ་ཐམས་ཅད་དང་ལྡན་པའི་ཕྱོགས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཡང་དག་པར་གང་བར་གྱུར་ཏོ། །
en: As soon as Mañjuśrī, the divine youth, entered this samādhi, the world sphere with all its directions—above, below, and across—up to its farthest reaches, became filled with lord buddhas.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་བཅོམ་ལྡན་འདས་དང་བཅས་པས། རྒྱལ་བའི་སྲས་ལེགས་སོ་ལེགས་སོ། །
en: Saṃkusumita Rājendra then said: {1.14} “Good, good it is, O son of the Victorious One,

source: འདི་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་ཁྱད་པར་ལ་སྙོམས་པར་ཞུགས་པ་ནི།
en: that you have entered this particular samādhi!

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་ནུས། བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་ལ་ཞུགས་པ་དང་། ས་བཅུ་ལ་གནས་པ་དག་གིས་ཀྱང་སྙོམས་པར་ཞུགས་པར་མི་ནུས་སོ། །
en: No śrāvakas, pratyeka­buddhas, or bodhisattvas who are established in the perfect conduct, not even those on the tenth bodhisattva level, are able to enter this samādhi.” {1.15}

source: དེ་ནས་བཅོམ་ལྡན་འདས་མེ་ཏོག་ཀུན་དུ་ཡང་དག་པར་སྐྱེས་པ་རྒྱལ་པོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ཡང་དག་པར་བགྲོས་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདིའི་སྙིང་པོ་མཆོག་ཏུ་གསང་བ། དོན་ཐམས་ཅད་སྒྲུབ་པའི་སྙིང་པོ་གསུངས་པ་ནི་ཡི་གེ་གཅིག་པ་ཞེས་བྱ་བ་མཆོག་ཏུ་གསང་བ།
en: Then Saṃkusumita Rājendra, having conferred with the lord buddhas, the tathāgatas, taught the following mantra of Mañjuśrī, the divine youth—his ultimately secret, innermost heart essence that accomplishes all purposes. This most secret, divine mantra, called One Syllable,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་ཐམས་ཅད་བྱེད་པ་སྔགས་ཀྱི་སྤྱོད་པ་ཁྱད་པར་ཅན་བཟང་པོ་ཡང་སྒྲུབ་པར་བྱེད་པའོ། །
en: which serves the interests of all beings, is also fit to accomplish the special mantra practice. {1.16}

source: དེ་ནས་བཅོམ་ལྡན་འདས་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པ་རྒྱལ་པོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་ཡུད་ཙམ་ཞིག་ཅང་མི་གསུང་བར་གྱུར་ཏེ།
en: Lord Saṃkusumita Rājendra, the tathāgata, became quiet for a moment.

source: ཐམས་ཅད་དང་ལྡན་པའི་འཇིག་རྟེན་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་གཟིགས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཡང་ཡང་དག་པར་དགོངས་ནས།
en: Looking with his buddha eye over all the world spheres, he considered all the lord buddhas dwelling there,

source: བྱམས་པའི་ཐུགས་ཀྱིས་སྔགས་གསུངས་སོ། །
en: and with a mind filled with love, pronounced the mantra:

source: ན་མཿསརྦ་བུདྡྷཱ་ནཱཾ་ཨཾ་མཾ།
en: “Homage to all the buddhas! “ Oṁ maṁ !”

source: འདི་ནི་འཇམ་དཔལ་གྱི་སྙིང་པོ་མཆོག་ཡིན་ཏེ་ལས་ཐམས་ཅད་བྱེད་པའོ། །
en: “This mantra is the ultimate heart essence of Mañjuśrī, which accomplishes all endeavors.” {1.17}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས། དཔེར་ན་སྐྱེས་བུ་སྟོབས་དང་ལྡན་པ་ལག་པ་བསྐུམ་པ་ལས་བརྐྱང་བ་དང་། བརྐྱང་བ་ལས་བསྐུམ་པའམ་སེལ་གོལ་གཏོགས་པ་ཙམ་མམ། མིག་འབྱེད་འཛུམས་ཙམ་ལ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱི་ཤུགས་བློ་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་ཁྱད་པར་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་ཏེམི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་ཆས་ཏེ་སླར་འཁོད་ནས།
en: Then Mañjuśrī, the divine youth, arose from the aforementioned samādhi and performed, in the time that it takes a strong person to bend or to extend their arm, or to snap their fingers, or to close and open their eyes, the miraculous, special samādhi called the intellect with the force of magical power , and went to the Sahā world.

source: སྟེང་གི་ནམ་མཁའི་དཀྱིལ་ན་ནོར་བུ་རིན་པོ་ཆེ་རབ་ཏུ་གནས་པའི་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་གནས་སུ་འདུག་སྟེ།
en: Having arrived there, he established himself in the palace of the gods of the Pure Abode founded upon fine jewels and gems in the canopy of the sky.

source: གནས་གཙང་མའི་གནས་དེ་ཐམས་ཅད་འོད་ཆེན་པོའི་སྣང་བས་གསལ་བར་བྱས་ཏེ། འོད་ཀྱི་རིན་པོ་ཆེས་རབ་ཏུ་བརྒྱན་ཅིང་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: Illuminating this entire realm of the Pure Abode with powerful rays of light, he entered the samādhi called the illuminator adorned with brilliant jewels. {1.18}

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལྷའི་མེ་ཏོག་རྣམ་པར་བཀོད་པ་དང་། རྒྱལ་མཚན་དང་བ་དན་དང་ཕྲེང་བའི་ཚོགས་དང་། རིན་པོ་ཆེའི་དྲིལ་བུའི་དྲ་བས་འབྲེལ་པ་སྙན་པའི་སྒྲ་སྒྲོགས་པ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཐོབ་པར་བྱེད་པ། ལྷའི་དྲི་དང་བྱུག་པ་དང་ཕྲེང་བ་དང་ཕྱེ་མའི་ཆར་འབབ་པར་མངོན་པར་སྤྲུལ་ཏོ། །
en: As soon as Mañjuśrī, the divine youth, entered this samādhi, he manifested through the power of bodhisattva transformation, for the worship of Lord Śākyamuni, a divinely created palace sumptuously studded with many gems and adorned with jeweled parasols spanning many hundred of thousands of leagues; bedecked with divinely beautiful great bundles of silk streamers; decorated with celestial flowers, banners, flags, garlands, and jewels; and pleasant with the sweet sound of draperies of latticed wind-chimes. Also, in the act of worshiping Lord Śākyamuni, he manifested a copious rain of perfume, garlands, ointments, wreaths, and scented powders. {1.19}

source: དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་མཐོང་ནས།
en: Seeing this extraordinary and marvelous display—a miracle of a bodhisattva—the hair of the gods of the Pure Abode stood on end in excitement.

source: བ་སྤུ་ལྡང་ཞིང་གནས་གཡོ་བ་མཐོང་ནས་སྙིང་འདར་ཞིང་དངངས་ཏེ།
en: When, however, they saw their abodes trembling, their hearts became tormented and pained.

source: ཅི་བདག་ཅག་གི་འབྱོར་པ་ཉམས་པར་མ་གྱུར་ཏམ་ཞེས་ཕན་ཚུན་དུ་རིངས་པར་འགྲོ་ཞིང་སྐད་མཐོན་པོས་སྨྲ་བ་རྩོམ་པར་བྱེད་དེ།
en: They immediately began to wail loudly, with a sense of great urgency, “Oh, what can this be? Could it be that we are being deprived of our divine powers?”

source: འདི་སྐད་དུ་བཅོམ་ལྡན་འདས་ཡོངས་སུ་བསྐྱབ་ཏུ་གསོལ། །
en: And they implored, “Please protect us, Lord!

source: ཤཱཀྱ་ཐུབ་པ་ཡོངས་སུ་བསྐྱབ་ཏུ་གསོལ་ཞེས་གསོལ་ཏོ། །
en: Please protect us, Śākyamuni!” {1.20}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་གནས་གཙང་མའི་འཁོར་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Lord Śākyamuni then addressed the entire assembly of the gods of the Pure Abode:

source: གྲོགས་པོ་དག་མ་འཇིགས་ཤིག་མ་འཇིགས་ཤིག །
en: “Do not be afraid, friends! Do not be afraid!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་ནི་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེའི་སྤྱན་སྔ་ནས་ང་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་བསྙེན་བཀུར་བྱ་བ་དང་། དོན་ཆེན་པོའི་སྤྱོད་པ་དང་སྔགས་ཀྱི་ཚིག་དང་། རྒྱ་ཆེ་ཞིང་རྨད་དུ་བྱུང་བའི་ཆོས་ཀྱི་ཚིག་སྟོན་པའི་ཕྱིར་འོངས་པ་ཡིན་ནོ། །
en: Mañjuśrī, the divine youth present here, the bodhisattva, the great being, has come here from the presence of the tathāgata Saṃkusumita Rājendra in the buddhafield Saṃkusumita , in order to see, worship, and serve me. He has come to teach the conduct of great purpose, the mantra subjects, and the vast and amazing Dharma subjects.” {1.21}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: The divine youth Mañjuśrī, in turn, circumambulated Lord Śākyamuni three times and,

source: མིག་མི་འཛུམས་པར་བཅོམ་ལྡན་འདས་ལ་བལྟ་ཞིང་ཞབས་གཉིས་ལ་བཏུད་དེ། ཚིག་འབྲུ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་བསྟོད་པ། །
en: looking at him with unblinking eyes, bowed down to his feet and praised him with these succinct words: {1.22}

source: སྐྱེས་བུ་བསྐྱེད་པ་ཁྱོད་ཕྱག་འཚལ། །
en: “Homage to you, the liberated one not subject to birth!

source: སྐྱེས་མཆོག་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, the best among men!

source: སྐྱེས་བུ་གཙོ་བོ་ཁྱོད་ཕྱག་འཚལ། །སྤྱོད་པ་ཐམས་ཅད་དོན་སྒྲུབ་པ། །
en: Homage to you, the elder of men, Who accomplishes all purposes of [mantra] conduct! {1.23}

source: སྐྱེས་བུ་སེང་གེ་ཁྱོད་ཕྱག་འཚལ། །ཕུང་ཁྲོལ་ཐམས་ཅད་ཟློག་བྱེད་པ། །
en: “Homage to you, O lion of a man, Who prevents anything undesirable from occurring!

source: དཔའ་བོ་ཆེན་པོ་ཁྱོད་ཕྱག་འཚལ། །ངན་འགྲོ་ཐམས་ཅད་འཇིག་བྱེད་པ། །
en: Homage to you, the great hero Who eliminates all evil destinies! {1.24}

source: སྐྱེས་བུ་པད་དཀར་ཁྱོད་ཕྱག་འཚལ། །ཀུན་ནས་བསོད་ནམས་དྲི་ལྡན་པ། །
en: “Homage to you, white lotus of a man, Who is fragrant with the scent of merit!

source: སྐྱེས་བུ་པདྨ་ཁྱོད་ཕྱག་འཚལ། །སྲིད་གསུམ་འདམ་ནི་རྣམ་དག་བྱེད། །
en: Homage to you, O lotus of a man, Who purifies the mire of the three types of existence! {1.25}

source: རྣམ་གྲོལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །སྡུག་བསྔལ་མ་ལུས་རྣམ་གྲོལ་བྱེད། །
en: “Homage to you, O liberated one, Who delivers from all pain!

source: ཞི་གྱུར་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །ཐམས་ཅད་ལྡན་པ་ལེགས་འདུལ་བྱེད། །
en: Homage to you, the tranquil one Who perfectly tames all the untamed ones! {1.26}

source: ཐམས་ཅད་གྲུབ་པ་ཁྱོད་ཕྱག་འཚལ། །སྔགས་ཀྱི་སྤྱོད་པའི་དོན་སྒྲུབ་བྱེད། །
en: “Homage to you, the accomplished one Who fulfills the purpose of all mantra practice!

source: བཀྲ་ཤིས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །བཀྲ་ཤིས་ཀུན་གྱི་བཀྲ་ཤིས་པ། །
en: Homage to you, the auspicious one, The most auspicious among all auspicious! {1.27}

source: སངས་རྒྱས་ཀུན་ལ་ཁྱོད་ཕྱག་འཚལ། །ཆོས་ཀུན་རྣམ་པར་རྟོགས་མཛད་པ། །
en: “Homage to you, the awakened one Who awakens others to the complete truth of the Dharma!

source: ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་སྤྲོས་པ་མེད་པའི་ངོ་བོ་ལ་ཡང་དག་པར་རྗེས་སུ་ཞུགས་ཤིང་སྟོན་པར་བྱེད་པའི་དེ་བཞིན་གཤེགས་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, the tathāgata, The one who abides in and teaches The suchness of all phenomena, Which is devoid of conceptual elaboration! {1.28}

source: ཤེས་པ་དང་ཤེས་བྱའི་དངོས་པོ་ཐམས་ཅད་དང་། འདུས་བྱས་དང་འདུས་མ་བྱས་དང་། ཐེག་པ་གསུམ་གྱི་ལམ་དང་། མྱ་ངན་ལས་འདས་པའི་ལམ་ལ་འཇོག་པར་བྱེད་པ་དང་། གནས་པར་བྱེད་པ་ཐམས་ཅད་མཁྱེན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་འབྲུ་འདི་དག་བརྗོད་པའི་བསྟོད་པའི་ཚིག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་སུམ་དུ་བསྟོད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “Homage to the omniscient one who is established, and is establishing others, in nirvāṇa and in the path of the three vehicles that encompasses all consciousnesses and all knowable objects, both conditioned and unconditioned!” {1.29} Having praised Lord Śākyamuni in his presence with these words, Mañjuśrī said:

source: བཅོམ་ལྡན་འདས་འདི་ནས་གང་གཱའི་ཀླུང་བརྒྱ་ཕྲག་སྟོང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདས་ནས། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་ན་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པ་ཞེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་མཆིས་ཏེ།
en: “There is, O lord, in the eastern direction beyond world spheres as numerous as the grains of sand in one hundred thousand Gaṅgā rivers, a buddhafield called Saṃkusumita .
